png("image.png", width = 480, height = 480, pointsize = 12, bg = "white", res = NA)

kenmei = c("北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県")
population = c(5535, 1392, 1352, 2340, 1108, 1188, 2052, 2964, 2011, 2012, 7113, 6122, 12838, 8917, 2391, 1101, 1168, 812, 871, 2171, 2100, 3800, 7403, 1875, 1402, 2629, 8806, 5586, 1404, 1012, 595, 725, 1948, 2869, 1463, 794, 1003, 1444, 773, 5054, 856, 1440, 1821, 1200, 1136, 1717, 1376)
area = c(83457, 8919, 15279, 6862, 11434, 6652, 13783, 6096, 6408, 6363, 3767, 5082, 2103, 2416, 10363, 2046, 4186, 4190, 4201, 13105, 9768, 7329, 5116, 5761, 3767, 4613, 1898, 8396, 3691, 4726, 3507, 6708, 7010, 8479, 6114, 4147, 1862, 5678, 7105, 4845, 2440, 4104, 7077, 5099, 6346, 9044, 2276)

par(las=1)          # 縦軸の文字を横向きにしない
par(mgp=c(2,0.7,0)) # マージンの調節（デフォルト: c(3,1,0)）
x = population/1000
y = area/10000
plot(x, y, xlab="人口（百万人）",
     ylab="", pch=16, log="xy")

axis(3, labels=FALSE)
axis(4, labels=FALSE)
pch=kenmei

text(population[kenmei=="東京都"]/1000,
     area[kenmei=="東京都"]/10000,
     "東京", pos=3)
text(population[kenmei=="北海道"]/1000,
     area[kenmei=="北海道"]/10000,
     "北海道", pos=1)
title("都道府県の人口と面積")
title(ylab=expression(paste("面積（万", km^2, "）")), line=2.5)
