l = [
     ['きゃ','k'],['きゅ','k'],['きょ','k'],['ぎゃ','g'],['ぎゅ','g'],
     ['ぎょ','g'],['しゃ','s'],['しゅ','s'],['しょ','s'],['じゃ','j'],
     ['じゅ','j'],['じょ','j'],['ちゃ','t'],['ちゅ','t'],['ちょ','t'],
     ['にゃ','n'],['にゅ','n'],['にょ','n'],['ひゃ','h'],['ひゅ','h'],
     ['ひょ','h'],['ぴゃ','p'],['ぴゅ','p'],['ぴょ','p'],['びゃ','b'],
     ['びゅ','b'],['びょ','b'],['みゃ','m'],['みゅ','m'],['みょ','m'],
     ['りゃ','r'],['りゅ','r'],['りょ','r'],
     ['あ','a'],['い','i'],['う','u'],['え','e'],['お','o'],
     ['か','k'],['き','k'],['く','k'],['け','k'],['こ','k'],
     ['さ','s'],['し','s'],['す','s'],['せ','s'],['そ','s'],
     ['た','t'],['ち','t'],['つ','t'],['て','t'],['と','t'],
     ['な','n'],['に','n'],['ぬ','n'],['ね','n'],['の','n'],
     ['は','h'],['ひ','h'],['ふ','h'],['へ','h'],['ほ','h'],
     ['ま','m'],['み','m'],['む','m'],['め','m'],['も','m'],
     ['や','y'],['ゆ','y'],['よ','y'],
     ['ら','r'],['り','r'],['る','r'],['れ','r'],['ろ','r'],
     ['わ','w'],['を','w'],['ん','w'],
     ['が','g'],['ぎ','g'],['ぐ','g'],['げ','g'],['ご','g'],
     ['ざ','z'],['じ','z'],['ず','z'],['ぜ','z'],['ぞ','z'],
     ['だ','d'],['ぢ','d'],['づ','d'],['で','d'],['ど','d'],
     ['ぱ','p'],['ぴ','p'],['ぷ','p'],['ぺ','p'],['ぽ','p'],
     ['ば','b'],['び','b'],['ぶ','b'],['べ','b'],['ぼ','b'],
    ]
nv = ""
function ksk(){
  console.log('hi');
  if(nv == document.getElementById('txt')) {
    return;
  }
  nv = document.getElementById('txt').value;
  for(var i = 0; i < l.length; i++) {
    nv = nv.replace(l[i][0],l[i][1]);
  }
  //nv = nv.replace('[^\d]','');
  document.getElementById('txt').value = nv;
}


